Revit 2027 API
BuiltInFailures.PipingFailures.DuctPipeSizeMismatch Property
 The duct/pipe size is invalid for the service definition
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId DuctPipeSizeMismatch { get; }
Public Shared ReadOnly Property DuctPipeSizeMismatch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ DuctPipeSizeMismatch {
	FailureDefinitionId^ get ();
}
static member DuctPipeSizeMismatch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.PipingFailures Class
Autodesk.Revit.DB Namespace